lib/xml/getUserProfile.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:getUserProfile>
            <!--Optional:-->
            <userProfileName>?</userProfileName>
        </ser:getUserProfile>
    </soapenv:Body>
</soapenv:Envelope>